SOAP/Customer_FavDT.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<wsse:UsernameToken wsu:Id="UsernameToken-2">
<wsse:Username>userNameVar</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">passwordVar</wsse:Password>
</wsse:UsernameToken>
</wsse:Security>
</soapenv:Header>
<soapenv:Body>
<bm:add xmlns:bm="http://xmlns.oracle.com/cpqcloud/dataTables/Customer_Fav">
<bm:DataTables bm:table_name="Customer_Fav">
<bm:each_record>
<bm:Material>materialVar</bm:Material>
<bm:CustomerID>custIDVar</bm:CustomerID>
<bm:MaterialDes>materialDescVar</bm:MaterialDes>
<bm:createdByLogin>createdByLoginVar</bm:createdByLogin>
</bm:each_record>
</bm:DataTables>
</bm:add>
</soapenv:Body>
</soapenv:Envelope>